GJS debugger. Type "help" for help
db> # SPDX-License-Identifier: MIT OR LGPL-2.0-or-later
db> # SPDX-FileCopyrightText: 2018 Philip Chimento <philip.chimento@gmail.com>
db> b 4
Breakpoint 1 at delete.debugger.js:4:1
db> b 5
Breakpoint 2 at delete.debugger.js:5:1
db> b 6
Breakpoint 3 at delete.debugger.js:6:1
db> b 7
Breakpoint 4 at delete.debugger.js:7:1
db> # Check that breakpoint 4 still remains after deleting 1-3
db> delete 1
Breakpoint 1 at delete.debugger.js:4:1 deleted
db> del 2
Breakpoint 2 at delete.debugger.js:5:1 deleted
db> d 3
Breakpoint 3 at delete.debugger.js:6:1 deleted
db> c
1
2
3
4
Breakpoint 4, toplevel at delete.debugger.js:7:1
db> c
5
Program exited with code 0
