GJS debugger. Type "help" for help
Debugger statement, toplevel at delete.debugger.js:1:0
db> b 2
Breakpoint 1 at delete.debugger.js:2:0
db> b 3
Breakpoint 2 at delete.debugger.js:3:0
db> b 4
Breakpoint 3 at delete.debugger.js:4:0
db> b 5
Breakpoint 4 at delete.debugger.js:5:0
db> # Check that breakpoint 4 still remains after deleting 1-3
db> delete 1
Breakpoint 1 at delete.debugger.js:2:0 deleted
db> del 2
Breakpoint 2 at delete.debugger.js:3:0 deleted
db> d 3
Breakpoint 3 at delete.debugger.js:4:0 deleted
db> c
1
2
3
4
Breakpoint 4, toplevel at delete.debugger.js:5:0
db> c
5
Program exited with code 0
