GJS debugger. Type "help" for help
db> # SPDX-License-Identifier: MIT OR LGPL-2.0-or-later
db> # SPDX-FileCopyrightText: 2021 Mantoh Nasah Kuma <nasahnash20@gmail.com>
db> set colors false
db> list
   6	    else if (a === undefined || b === undefined)
   7	        return undefined;
   8	    else
   9	        return a / b;
   10	}
  *11	divide();
   12	
db> list 4
   1	// SPDX-License-Identifier: MIT OR LGPL-2.0-or-later
   2	// SPDX-FileCopyrightText: 2021 Mantoh Nasah Kuma <nasahnash20@gmail.com>
   3	function divide(a, b) {
  *4	    if (b === 0)
   5	        return undefined;
   6	    else if (a === undefined || b === undefined)
   7	        return undefined;
   8	    else
   9	        return a / b;
db> list 11
   6	    else if (a === undefined || b === undefined)
   7	        return undefined;
   8	    else
   9	        return a / b;
   10	}
  *11	divide();
   12	
db> list 12
   7	        return undefined;
   8	    else
   9	        return a / b;
   10	}
   11	divide();
  *12	
db> list 0
   1	// SPDX-License-Identifier: MIT OR LGPL-2.0-or-later
   2	// SPDX-FileCopyrightText: 2021 Mantoh Nasah Kuma <nasahnash20@gmail.com>
   3	function divide(a, b) {
   4	    if (b === 0)
   5	        return undefined;
db> list divide
Unknown option
db> break 4
Breakpoint 1 at list.debugger.js:4:9
db> c
Breakpoint 1, divide() at list.debugger.js:4:9
db> list
   1	// SPDX-License-Identifier: MIT OR LGPL-2.0-or-later
   2	// SPDX-FileCopyrightText: 2021 Mantoh Nasah Kuma <nasahnash20@gmail.com>
   3	function divide(a, b) {
  *4	    if (b === 0)
   5	        return undefined;
   6	    else if (a === undefined || b === undefined)
   7	        return undefined;
   8	    else
   9	        return a / b;
db> q
Program exited with code 0
