GJS debugger. Type "help" for help
db> # SPDX-License-Identifier: MIT OR LGPL-2.0-or-later
db> # SPDX-FileCopyrightText: 2018 Philip Chimento <philip.chimento@gmail.com>
db> c
Debugger statement, toplevel at print.debugger.js:19:0
db> # Simple types
db> print a
$1 = undefined
db> p b
$2 = null
db> p c
$3 = 42
db> p d
$4 = "some string"
db> p e
$5 = false
db> p f
$6 = true
db> p g
$7 = Symbol("foobar")
db> # Objects
db> print h
$8 = [object Array]
[1, "money", 2, "show", { three: "to", get ready: "go cat go" }]
db> print/b h
$9 = [object Array]
[object Array]
db> print/p h
$10 = [object Array]
[1, "money", 2, "show", { three: "to", get ready: "go cat go" }]
db> p i
$11 = [object Object]
{ some: "plain object", that: "has keys" }
db> p/b i
$12 = [object Object]
[object Object]
db> p j
$13 = [object Set]
{}
db> p k
$14 = [object Function]
[ Function: J ]
db> p/b k
$15 = [object Function]
[object Function]
db> p l
$16 = [object GObject_Object]
[object instance wrapper GIName:GObject.Object jsobj@0xADDR native@0xADDR]
db> p m
$17 = [object Error]
Error: message
db> p n
$18 = [object Object]
{ a: 1 }
db> p o
$19 = [object Object]
{ some: "plain object", [Symbol("that")]: "has symbols" }
db> c
Program exited with code 0
